c-jimmy886/stm32code/个人成功代码/4-2 驱动m3508 -全向轮/Hardware/omni.c
#include "stm32f10x.h"                  // Device header
#include "m3508.h"
#include "pid.h"
#include <math.h>
#define M_PI  3.14


extern Motor_TypeDef Motor[4];

void omni(float target_speed,float target_angle,float yaw_target,
	void* pid,void* pid1,void* pid2,void* pid3)
{
	
	PID_TypeDef* speed_pid = (PID_TypeDef*)pid;
	PID_TypeDef* speed_pid1 = (PID_TypeDef*)pid1;
	PID_TypeDef* speed_pid2 = (PID_TypeDef*)pid2;
	PID_TypeDef* speed_pid3 = (PID_TypeDef*)pid3;
	
	
	 float target_angle_rad = target_angle * M_PI / 180.0; 
	
	
	 if (yaw_target > M_PI) yaw_target -= 2 * M_PI;
     else if (yaw_target < -M_PI) yaw_target += 2 * M_PI;

//      target_speed*=63;
	
	 float vx = target_speed * cos(target_angle_rad);  // x轴方向速度
     float vy = target_speed * sin(target_angle_rad);  // y轴方向速度
	
	 double z_correction =0;

    z_correction=0;
	
	Motor[0].target_speed = vx  + vy - z_correction; // 左前轮;
    Motor[1].target_speed = vx  - vy + z_correction; // 右前轮;
    Motor[2].target_speed = -vx + vy - z_correction; // 左后轮;
    Motor[3].target_speed = -vx - vy + z_correction; // 右后轮;
	
	
	float output = PID_Calculate(speed_pid,  Motor[0].target_speed, Motor[0].real_speed);
	float output1 = PID_Calculate(speed_pid1,Motor[1].target_speed, Motor[1].real_speed);
	float output2 = PID_Calculate(speed_pid2,Motor[2].target_speed, Motor[2].real_speed);
	float output3 = PID_Calculate(speed_pid3,Motor[3].target_speed, Motor[3].real_speed);
	                 
					 
    if(output>5000)
	{
       output=5000;
	}	
	if(output1>5000)
	{
       output1=5000;
	}	
	if(output2>5000)
	{
       output2=5000;
	}	
	if(output3>5000)
	{
       output3=5000;
	}
	
	if(output<-5000)
	{
       output=-5000;
	}
    if(output1<-5000)
	{
       output1=-5000;
	}	
	if(output2<-5000)
	{
       output2=-5000;
	}	
	if(output3<-5000)
	{
       output3=-5000;
	}		

	
	
	M3508_SetCurrent((int16_t)output,(int16_t)output1,(int16_t)output2,(int16_t)output3);
}



